# stepik7.2.10

Степени двойки 
По заданному 
N
N вывести через пробел все (натуральные, т.е. 
1
,
2
,
3
,
…
1,2,3,… ) степени числа 
2
2, для которых 
2
k
≤
N
2 
k
 ≤N.

Входные данные:
Целое натуральное число 
N
N, причем 
N
<
30000
N<30000.

Выходные данные: 
Натуральные числа от 
1
1 до 
p
p, такие, что если посчитать 
2
k
2 
k
 , то получится число не превосходящее 
N
N.


#include <stdio.h>
#include <math.h>

int main()
{
    int n, k = 1;
    scanf("%d", &n);

    while(pow(2,k) <= n)
    printf(" %d", k++);
    
    if(n == 1)
        printf(" ");
    else 
    k++;
    
    return 0;
}
